read_verilog /mnt/d/OneDrive/projects/Attention-VLSI/optimization/addition/hierarchical_synthesis/synthesis_results/float_4e3m_adder_behavioral.v
hierarchy -check -top float_4e3m_adder
proc
opt
fsm
opt
memory
opt
techmap
opt
abc
opt
clean
stat
write_verilog /mnt/d/OneDrive/projects/Attention-VLSI/optimization/addition/hierarchical_synthesis/synthesis_results/float_4e3m_adder_yosys_optimized.v
write_blif /mnt/d/OneDrive/projects/Attention-VLSI/optimization/addition/hierarchical_synthesis/synthesis_results/float_4e3m_adder_yosys_optimized.blif
